[{"date": "March 12, 2021", "title": "BMW Wants to Transition MINI Brand to All-Electric by 2030", "fullArticle": "Recently, several automakers have announced plans to go fully electric by 2030 at the latest, with some brands like Ford aiming at an earlier conversion. Yet, German brands have been oddly quiet about full electric conversions, especially BMW, who actually reinforced the idea of using internal combustion recently. However, the suits in Munich must have heard the criticism of such decisions and have decided to meet some critics halfway and switch the MINI brand entirely over to electrification by 2030.According to a recent article from Spiegel Magazine, BMW boss Oliver Zipse claims that MINI will be the first part of the BMW Group to fully switch over to electrification and the ball will start rolling soon. In fact, Zipse claimed that the last internal-combustion MINI will debut in 2025 and that by 2027, half of the entire MINI range will be electric.Apparently, BMW’s relationship with Chinese manufacturer Great Wall has a lot to do with this plan and could likely handle a lot of the manufacturing of said electric MINIs.It also states in this article that Zipse will be announcing BMW’s plans to electrify the rest of BMW’s lineup later next week. As of right now, there’s no timeframe to when such a transition might happen or even begin for BMW. Hopefully BMW understands that it needs to happen sooner than later.At the moment, the only electric cars BMW has on sale are the iX3 and i3 and neither of which are available in all markets and neither of which are particularly competitive. Plus, the BMW i3 is doomed, reaching the end of production as we speak. The BMW iX will replace it  and the i4 is on the way but BMW really needs to get a move on after that. Tesla obviously has its suite of EVs to contend with and now even Audi has three electric models, with all three boasting two different variants, with several more planned to debut by 2025.Learning that MINI will switch to 100-percent EV by 2030 is very encouraging and, honestly, MINI is one of the best brands for electrification. Though, we would like to see more from BMW and hopefully we will within the coming weeks.[Source: Spiegel]", "author": "Nico DeMattia"}, {"date": "March 12, 2021", "title": "117-mile 2000 Mini Rover Sport going under the hammer", "fullArticle": "The classic Mini is an incredibly potent and fun to drive car. It packs a punch for its size and you can’t argue with its huge fun factor, hidden well beneath those small bits of steel that make up its body. The best part about this car though is that it remained in production almost unchanged for about 50 years. Up until BMW bought the British brand, the compact Mini had a design that was virtually unchanged since Sir Alec Issigonis first drew it on a piece of paper back in the 1950s.That’s how, if you look hard enough, you can find a Mini with those trademark looks that’s actually not incredibly old, like the one we’re showing you today. Listed on Classic Car Auctions, this Mini is a 2000 model with only 117 miles on the clock. This is as close as it gets to ‘brand new’ for one of these cars. Now, what you should know is that even though the exterior design didn’t change much, the technical side of things and even the brand did over such a long period of time.In 2000, the Mini was built by Rover and had a bigger engine than what the original used. At 1,275-cc, the four-cylinder mill had over 70 horsepower. That’s not a lot but the car is incredibly light. It also came with different color choices and wheels, looking as good as it gets. This particular one seems to be wearing British Racing Green along with white stripes on the hood and four extra headlights on the front bumper, for a bit more character.The car’s extremely low mileage is what will sell it in the end. According to the ad, it was bought from Beadles Rover of Gillingham in the UK and had only one previous owner, who kept it in dry storage for the last 12 years. The car is expected to get anything between £25,000 – £30,000.[Source: Classic Car Auctions]", "author": "Gabriel Nica"}]